architectures/diagrams/originServer.puml
@startuml
:Request;
:API Gateway;

if (What's the URL path?) then (/log)
  :serveLogEndpoint;
else (Any other path)
  :servePages;
endif

:Response;
@enduml
